{
  "formaction": "/admin/list",
  "title": "Publick Apache Sling + Sightly blog engine",
  "months": [
    {
      "value": 1,
      "selected": false
    },
    {
      "value": 2,
      "selected": false
    },
    {
      "value": 3,
      "selected": false
    },
    {
      "value": 4,
      "selected": false
    },
    {
      "value": 5,
      "selected": false
    },
    {
      "value": 6,
      "selected": false
    },
    {
      "value": 7,
      "selected": false
    },
    {
      "value": 8,
      "selected": false
    },
    {
      "value": 9,
      "selected": true
    },
    {
      "value": 10,
      "selected": false
    },
    {
      "value": 11,
      "selected": false
    },
    {
      "value": 12,
      "selected": false
    }
  ],
  "years": [
    {
      "value": 2013,
      "selected": false
    },
    {
      "value": 2014,
      "selected": false
    },
    {
      "value": 2015,
      "selected": true
    },
    {
      "value": 2016,
      "selected": false
    },
    {
      "value": 2017,
      "selected": false
    }
  ],
  "url": "publick-apache-sling-sightly-blog-engine",
  "visible": true,
  "keywordsJson": "[&quot;Publick&quot;,&quot;Sling&quot;,&quot;Sightly&quot;]",
  "description": "Introducing the Publick Apache Sling + Sightly blog engine.",
  "content": "&lt;div&gt;This blog post is the unveiling of the &lt;span style=&quot;font-style: italic;&quot;&gt;Publick Sling + Sightly blog engine&lt;/span&gt;. The name of the project is in honor of &lt;span style=&quot;font-style: italic;&quot;&gt;Publick Occurrences Both Forreign and Domestick&lt;/span&gt;, the first multi-page newspaper published in the American colonies.&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;Anyone familiar with AEM will immediately feel comfortable with this project as the Publick blog engine uses the same technology stack as the latest Adobe Experience Manager. Publick uses the Sightly server-side templating language to render the markup. The restful Apache Sling framework is used to access the Apache Jackrabbit implementation of the Java Content Repository. Apache Felix is the implement of the OSGi framework and Apache Maven is used to manage the builds.&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;&lt;img class=&quot;img-responsive&quot; alt=&quot;Screenshot of the asset upload capability of Publick.&quot; src=&quot;/content/assets/images/screen-shots-assets.png&quot;&gt;&lt;/div&gt;&lt;div&gt;I've wanted to write about my experiences, my work and my passion for quite some time. I could have used Blogger or Medium and I considered using Jekyll with GitHub Pages for more excitement. I could have had a WordPress site running in mere minutes. However, I came to the conclusion that using any of those platforms to blog about the Adobe Marketing Cloud and Adobe Experience Manager specifically, just didn't resonate harmoniously within. The virtuous platform would of course been AEM itself, however, I simply can't afford to purchase a license from Adobe - maybe it's the preposterous cost of renting in the San Francisco Bay Area. Therefore, I did the next best thing; I dedicated my free time to writing a custom blog engine that uses the same technology stack as Adobe Experience Manager.&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;I've made the code for the blog engine publicly available on GitHub. Likewise, I've done the same for the nateyolles.com implementation of Publick. The purpose of this website is to share my thoughts and experiences. However, it is also meant to be a living demonstration of the Publick blog engine. For that reason, I've created a read-only test account and published the credentials. You can log into the dashboard at &lt;a href=&quot;http://www.nateyolles.com/admin&quot; target=&quot;_blank&quot;&gt;nateyolles.com/admin&lt;/a&gt; with user &lt;span style=&quot;font-style: italic;&quot;&gt;demo&lt;/span&gt; and password &lt;span style=&quot;font-style: italic;&quot;&gt;demo&lt;/span&gt;.&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;For this project, I'm using a scaled down version of a similar setup that we're using to host Adobe's Document Cloud AEM marketing site. I'm using an EC2 instance running Amazon's Linux AMI to host the Sling server. Emails are sent through Amazon's Simple Email Service (SES). GoDaddy remains my DNS manager with the A record pointing to my Amazon Elastic IP address and the MX record remaining at GoDaddy to manage my personal emails. The next step is to implement Adobe's Dispatcher Apache web server module for added security and performance. At Adobe my project is using Akamai's CDN; for this project I want to try Amazon's CloudFront. Thanks to Amazon's free tier and the open source Apache projects, this entire setup is near cost free. My only expense is renewing my domain name.&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;This project, like all projects, is a work in progress and a learning experience. It's been a rich, rewarding, and enormously satisfying process getting into the lower levels of Sling and Jackrabbit, all of which is completely applicable to AEM. There's still very much left to accomplish and I look forward to its continued progress.&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;Publick Sling + Sightly blog engine on GitHub&lt;/div&gt;&lt;div&gt;&lt;a href=&quot;https://github.com/nateyolles/publick-sling-blog&quot; target=&quot;_blank&quot;&gt;https://github.com/nateyolles/publick-sling-blog&lt;/a&gt;&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;nateyolles.com implementation of Publick on GitHub&lt;/div&gt;&lt;div&gt;&lt;a href=&quot;https://github.com/nateyolles/publick-nateyolles&quot; target=&quot;_blank&quot;&gt;https://github.com/nateyolles/publick-nateyolles&lt;/a&gt;&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;Publick live example (user/pass: demo/demo)&lt;/div&gt;&lt;div&gt;&lt;a href=&quot;http://www.nateyolles.com/admin&quot; target=&quot;_blank&quot;&gt;http://www.nateyolles.com/admin&lt;/a&gt;&lt;/div&gt;",
  "submitDisabled": false
}
